export const ONES = [
  "බිංදුව",
  "එක",
  "දෙක",
  "තුන",
  "හතර",
  "පහ",
  "හය",
  "හත",
  "අට",
  "නවය",
  "දහය",
  "එකොළහ",
  "දොළහ",
  "දහතුන",
  "දහහතර",
  "පහළොව",
  "දහසය",
  "දහහත",
  "දහඅට",
  "දහනවය",
] as const;

export const TENS: Record<number, string> = {
  20: "විස්ස",
  30: "තිහ",
  40: "හතළිහ",
  50: "පනහ",
  60: "හැට",
  70: "හැත්තෑව",
  80: "අසූව",
  90: "අනූව",
};

export const TENS_PREFIX: Record<number, string> = {
  20: "විසි",
  30: "තිස්",
  40: "හතළිස්",
  50: "පනස්",
  60: "හැට",
  70: "හැත්තෑ",
  80: "අසූ",
  90: "අනූ",
};

export const HUNDREDS: Record<number, string> = {
  1: "සිය",
  2: "දෙසිය",
  3: "තුන්සිය",
  4: "හාරසිය",
  5: "පන්සිය",
  6: "හයසිය",
  7: "හත්සිය",
  8: "අටසිය",
  9: "නවසිය",
};

export const THOUSANDS: Record<number, string> = {
  1: "දහස",
  2: "දෙදහස",
  3: "තුන්දහස",
  4: "හාරදහස",
  5: "පන්දහස",
  6: "හයදහස",
  7: "හත්දහස",
  8: "අටදහස",
  9: "නවදහස",
};

export const THOUSANDS_PREFIX: Record<number, string> = {
  1: "එක්දහස්",
  2: "දෙදහස්",
  3: "තුන්දහස්",
  4: "හාරදහස්",
  5: "පන්දහස්",
  6: "හයදහස්",
  7: "හත්දහස්",
  8: "අටදහස්",
  9: "නවදහස්",
};

export const THOUSANDS_BASE_PREFIX: Record<number, string> = {
  1: "එක්",
  2: "දෙ",
  3: "තුන්",
  4: "හාර",
  5: "පන්",
  6: "හය",
  7: "හත්",
  8: "අට",
  9: "නව",
  10: "දස",
  11: "එකොළොස්",
  12: "දොළොස්",
  13: "දහතුන්",
  14: "දහහතර",
  15: "පහළොස්",
  16: "දහසය",
  17: "දහහත්",
  18: "දහඅට",
  19: "දහනව",
};
